{"meta":{"title":"Xin's blog","subtitle":"","description":"Computational social science, NLP","author":"Xin Zhou","url":"https://CinkerZX.github.io","root":"/"},"pages":[],"posts":[{"title":"Remarkable 2 Review","slug":"Remarkable2 review","date":"2020-11-10T13:59:15.725Z","updated":"2021-02-28T22:09:28.054Z","comments":true,"path":"2020/11/10/Remarkable2 review/","link":"","permalink":"https://cinkerzx.github.io/2020/11/10/Remarkable2%20review/","excerpt":"","text":"Hello, this is a review for Remarkable 2, despite there have been lots of reviews about this product on YouTube, including horizontal compare with other E-readers, and vertical compare with Remarkable 1, as a scientific researcher, I was still unsure that if this product is suitable for me, with the information produced by those Youtubers. In this review I will share with you my experience on using Remarkable2 for reading papers, Ebooks, and taking notes. Hope this review can be helpful for you. Basic information about Remarkable2Note: You can skip this part if you have already know the basic information of this product Price: please refer it’s official cite Remarkable2. Tablet: 399 euro Marker: 59 (without eraser on the end) or 99 euro (with the eraser on the end) Folios: 79 or 99 euro. Based on my experience, there is no need to buy the folio to add its weight or thickness Notes about the marker The marker is designed with magnetism, can be attracted to the right edge of the tablet Much heavier than a normal pen, it will take several hours for you to get used to it The tips of the marker need to be replaced, there will be 10 tips given for free when you but the marker The eraser on the end of the pen is not that convenient. The undo button can be more useful. If you use the side of the eraser, the contact area is too small, while if you use the entire eraser head, it will be too big, so you cannot wipe words off presisely, especially when you just need to wipe one letter Notes about the tablet The design is very simple, I gave it 5 start. One USB typeC One turn on&amp;off button 5 metal contacts, buy no external devices can be connected with currently Easy to hold with only one hand. But I feel using it on a table is better, cause I can use my left hand to control the manu bar on the left side, while right hand controlling the marker Battery: reading papers continuously for 2h, take around 10% battery. Can feel free to take it outside with you for a whole day. Screen: the screen do not have light, so you cannot use it in dark enviornment. in addition, even though the screen is frosted glass like, but reflection still exists Drawing function: some people say there is no delay, writing on the tablet is like writing on the paper… I believe they are a bit exaggerating. No doubt that the marker is sensitive, but there is a short delay, you can see the blank between the emerging lines with your moving tip. And writing is not like writing on paper, cause the tablet serface and the tips are hard, the feeling is like wrting on a frosted glass Reading papers and reading e-EbooksCommon features Color: The screen is ink, so for those colorful figures, they are showed in different grey The color of the screen has less light, and should be able to protect your eyes Take notes: it’s easy to select different pens, such as Ballpoint pen, Pencil, Highlighter, etc Easy to focus: It’s unlikely to be disttracted when using it, because you have strong sense of intreatction when reading. First, you are taking notes, meanwhile, you are using your left hand to control the manu It does not have any other apps to distracted you Sharing: it’s easy to share the pdf, the e-book, or your notes with your friends by sending it via email sharing is one-direct, only we can send the shared pages to our friends, but they cannot reply us directly Reading papers Quite suitable Size of the text: the size of the text will be smaller than you print it out For double-column papers, the “zoom in” function works perfectly, it allows you to cut the whole page into 4 parts, and focus on one parts at one time. For me, it’s even easier than reading printed papers, cause it’s easy for me to see it clearly, and make notes For one-column papers, it’s not that easy to use “zoom in” function, but we can adjust view, which can cut off the margins, and focus on the text. But sometimes it might be still small Find the wanted page: it has “searching” function, which allows you to search by key words, this function is easy to used it has page overview function, but after overview, it’s hard to see the text on the page, and it’s hard to scoll up and down to select the wanted page, as every time, when content changed on the screen, Remarkable 2 needs around 1 second to present the new content flip pages directly. As mentioned before, this tablet needs 1 second to update, so it’s not that easy to go over all pages as we did on laptop, or use printed papers Reading e-Ebooks Format: only EPUB format is acceptable. Size of the text: EPUB format e-book is flexible, you can individualize the format of text, size of text, etc In terms of finding the wanted page Take notes1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}],"categories":[],"tags":[]}