{"meta":{"title":"Xin's blog","subtitle":"","description":"Computational social science, NLP","author":"Xin Zhou","url":"https://CinkerZX.github.io","root":"/"},"pages":[],"posts":[{"title":"Remarkable 2 Review","slug":"Remarkable2 review","date":"2020-11-10T13:59:15.725Z","updated":"2021-03-03T03:51:59.060Z","comments":true,"path":"2020/11/10/Remarkable2 review/","link":"","permalink":"https://cinkerzx.github.io/2020/11/10/Remarkable2%20review/","excerpt":"","text":"Hello, this is a review for Remarkable 2, despite there have been lots of reviews about this product on YouTube, including horizontal compare with other E-readers, and vertical compare with Remarkable 1, as a researcher, I was still unsure if this product is a suitable tool for me. I did’t know if the screen would be too small to read papers, specially for myopia vision; or if the ink screen would be inconvenient to mark. That’s why I make this review, I will share with you my experience on using Remarkable 2 for reading papers, Ebooks, and taking notes. Hope this review can be helpful to you. Table of Contents Basic information about Remarkable 2 Reading papers and e-books Common features Reading papers Reading e-books Use it as a notebook Basic information about Remarkable 2Note: You can skip this part if you have already know the basic information of this product Price: please refer it’s official webcite Remarkable2 Tablet: 399 euro Marker: 59 (without eraser on the end) or 99 euro (with the eraser on the end) Folios: 79 or 99 euro. Based on my experience, there is no need to buy the folio to add its weight or thickness Notes about the marker The marker is designed with magnetism, can be attracted to the right edge of the tablet Much heavier than a normal pen, it will take several hours for you to get used to it The tips of the marker need to be replaced, there will be 10 tips given for free when you but the marker The eraser on the end of the pen is not that convenient. The undo button can be more useful. If you use the side of the eraser, the contact area is too small, while if you use the entire eraser head, it will be too big, so you cannot wipe words off precisely, especially when you just need to wipe one letter Notes about the tablet The design is very simple, like an art work. I gave it 5 stars One USB typeC One turn on&amp;off button 5 metal contacts, but no external devices can be connected with currently Easy to hold with only one hand. But I feel using it on a table is better, cause I can use my left hand to control the menu bar on the left side, while right hand controlling the marker Battery: reading papers continuously for 2h, take around 10% battery. Can feel free to take it outside with you for a whole day Screen: the screen do not have light, so you cannot use it in dark environment. in addition, even though the screen is frosted glass like, but reflection still exists Drawing function: some people say there is no delay, writing on the tablet is like writing on the paper… I believe they are a bit exaggerating. No doubt that the marker is sensitive, but there is a short delay, you can see the blank between the emerging lines with your moving tip. And writing is not like writing on paper, as the tablet surface and the tips are hard, the feeling is like writing on a frosted glass Reading papers and e-booksCommon features Color The screen is ink, so for those colorful figures, they are showed in different grey The color of the screen has less light, and should be able to protect your eyes Take notes it’s easy to select different pens, such as Ballpoint pen, Pencil, Highlighter, etc Easy to focus It’s unlikely to be distracted when using it, because you have strong sense of interaction when reading. You need to use one hand to control the menu, another hand to take notes, also need to think It does not have any other apps to distracted you Sharing function It allows you to share the pdf, the e-book, or your notes via email Sharing is one-direct, only we can send the shared pages to our friends, but they cannot reply us directly For pdf papers and EPUB e-books, Remarkable 2 provides “Live-view” which allows you to view the page via another screen on live. This is another very useful function. You can demonstrate easily with this function Layer function You can add layers Can show/hide any layer Can choose which layer to take notes This function is very useful, when we have any inspiration, we can close the background, and just create a new layer, then we can record our ideas down directly on a blank page. You can choose to show or hide this layer freely Find the wanted page It has “searching” function, which allows you to search by key words, this function is easy to used It has a “page overview” function, but after overview, it’s hard to see the text on the page. In addition, it’s slow to scroll up and down to select the wanted page, as every time when content changed on the screen, the tablet needs around 1 second to present the new content Flip pages directly. As mentioned before, this tablet needs 1 second to update, thus, it’s not easy to flip compared with using laptop, or printed papers Reading papers Quite suitable Size of the text: the size of the text will be smaller than you print it out For double-column papers, the “zoom in” function works perfectly, it allows you to cut the whole page into 4 parts, and focus on one parts at one time. For me, it’s even easier than reading printed papers, cause it’s easy for me to see it clearly, and make notes For one-column papers, it’s not that easy to use “zoom in” function, but we can adjust view, which can cut off the margins, and focus on the text. But sometimes it might be still small A paper example Reading e-books Quite suitable Format: only EPUB format is acceptable. Size of the text: EPUB format e-book is flexible, you can individualize the format of text, size of text, etc In terms of finding the wanted page An e-book example Use it as a notebook Quite suitable It has many template for users to choose, usually, I use Cornell Notes for courses Despite there are only black, grey and white to choose, but in the meantime, there are 8 kinds of pens you can choose from, it’s easy to distinguish or strengthen the contents An note example Conclusion: based on my 2 weeks using experience, I really enjoy working with it. It might be a bit pricey for a student, but if you love reading, if you really need a tool to help you being focus, Remarkable 2 is highly recommended. It provides you all necessary functions without any redundancy.","categories":[],"tags":[]}],"categories":[],"tags":[]}